app/controllers/foods_controller.rb

  def create
    @food = current_user.foods.new(food_params)
    respond_to do |format|
      if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", nil], ["measurement_unit", nil], ["price", nil], ["quantity", nil], ["user_id", nil], ["created_at", "2023-11-14 17:21:34.151488"], ["updated_at", "2023-11-14 17:21:34.151488"]]

  def destroy
    @food.destroy!
---
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]